tools/vim.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>vim.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/tools/tmux.org.html">Prev: tmux.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/tools">Up: tools</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="command-line">Command Line</h1>
<h2 id="types">Types</h2>
<ul class="incremental">
<li>colon command (:)</li>
<li>search (/ or ?)</li>
<li>filter command (!)</li>
</ul>
<h2 id="features">features</h2>
<dl class="incremental">
<dt>abbrevations</dt>
<dd>both for command and option names
</dd>
<dt>context sensitive completion</dt>
<dd><em>&lt;Tab&gt;</em> or <em>CTRL-P</em>
</dd>
<dt>list matches</dt>
<dd>press <em>CTRL-D</em> to show all matched items
</dd>
<dt>complete to the longest unambiguous string</dt>
<dd><em>CTRL-L</em>
</dd>
</dl>
<h2 id="abbreviations">abbreviations</h2>
<p>There is <strong>no</strong> logic behind which one will be used if they have the same prefix. Just remember it. And Always use the full name in the script as you can.</p>
<table>
<thead>
<tr class="header">
<th>abbr</th>
<th>command</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>s</td>
<td>substitute</td>
</tr>
<tr class="even">
<td>fun</td>
<td>function</td>
</tr>
<tr class="odd">
<td>w</td>
<td>write</td>
</tr>
<tr class="even">
<td>r</td>
<td>read</td>
</tr>
<tr class="odd">
<td>end</td>
<td>endif/endwhile/endfunction</td>
</tr>
</tbody>
</table>
<p>Many options also have a short name, such as <code>ai</code> is short for <code>autoindent</code></p>
<h2 id="history">history</h2>
<ul class="incremental">
<li>Press <em>&lt;Up&gt;</em> to show the previous matched command</li>
<li>Press &lt;Down&gt; to take you go back to the newer commands</li>
<li><code>:history</code> show the matched history</li>
<li><code>CTRL-P</code> go to the previous command and doesn't match what you already typed</li>
</ul>
<h2 id="command-line-window">command line window</h2>
<p>Open the command line window with <code>q:</code> command with Normal mode. Modify the buffer and press <code>&lt;Enter&gt;</code> to execute current line's command.</p>
<h2 id="shortcut">Shortcut</h2>
<table>
<thead>
<tr class="header">
<th>key press</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>&lt;S-Left&gt; or &lt;C-Left&gt;</td>
<td>one word left</td>
</tr>
<tr class="even">
<td>&lt;S-Right&gt; or &lt;C-Right&gt;</td>
<td>one word right</td>
</tr>
<tr class="odd">
<td>CTRL-B</td>
<td>begin of command line</td>
</tr>
<tr class="even">
<td>CTRL-E</td>
<td>end of command line</td>
</tr>
<tr class="odd">
<td>CTRL-W</td>
<td>delete a whole word before</td>
</tr>
<tr class="even">
<td>CTRL-U</td>
<td>remove all text</td>
</tr>
<tr class="odd">
<td>&lt;Esc&gt; or CTRL-C</td>
<td>Cancelling</td>
</tr>
<tr class="even">
<td>CTRL-L</td>
<td>complete to the longest unambiguous string</td>
</tr>
<tr class="odd">
<td>CTRL-P</td>
<td>previous command</td>
</tr>
<tr class="even">
<td>CTRL-N</td>
<td>next command</td>
</tr>
</tbody>
</table>

      </div>
    </section>
  </body>
</html>
